#include<iostream>
using namespace std;
int main()
{
	int n=8113-5343-16; // n 为天数，利用题目中给的例子可以减少计算量 
	
	//这个二维数组用来存放月份 
	int a[2][13]={  {0,31,28,31,30,31,30,31,31,30,31,30,31}, //平年月份 
					{0,31,29,31,30,31,30,31,31,30,31,30,31}  };//闰年月份 
	int y=1792; // y 是年份，从1792开始算 
	
	do
	{
		if((y%4==0&&y%100!=0)||y%400==0) //判断是否为闰年 
		{
			n=n-366;  //如果为闰年则减去366天 
			y++; 
		}
		else
		{
			n=n-365;  //如果为平年则减去365天 
			y++	;
		}
	}while(n>=366);
	
	int r=0,i=1; // r 用来记录是否为闰年，平年 r=0，闰年 r=1 ，i 是月份 
	if((y%4==0&&y%100!=0)||y%400==0)
		r=1;   //闰年 r=1 
	while(n>=a[r][i])  //当剩余的天数大于等于月份的天数时 
	{
		n-=a[r][i];  //减去当月天数 
		i++;  //月份加一 
	}
	printf("%d-%02d-%02d",y,i,n);
	return 0;
 } 
